# Application Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..Application Property
UIApplication Class See Also
---
Returns the database level Application represented by this UI level Application.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Application Application { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Application As Application
	Get
```

Visual C++
---
```text
public:
property Application^ Application {
	Application^ get ();
}
```

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace